/******************************************************************
本程序只供学习使用，未经作者许可，不得用于其它任何用途
程序结构参考 安徽师范大学  Lyzhangxiang的EasyHW OS结构设计
uart1.C  file
作者：bg8wj
建立日期: 2011.12.23
版本：V1.0
Copyright(C) bg8wj
/*******************************************************************/
#include "Uart1.h"
#include "STC12C5A60S2.h"
#include "string.h"
/************************************************************
				   uart1初始化
*************************************************************/
void InitUart1()
{
   PCON |= 0x80;		//使能波特率倍速位SMOD
	SCON = 0x50;		//8位数据,可变波特率
	BRT = 0xB2;		//设定独立波特率发生器重装值
	AUXR |= 0x04;		//独立波特率发生器时钟为Fosc,即1T
	AUXR |= 0x01;		//串口1选择独立波特率发生器为波特率发生器
	AUXR |= 0x10;		//启动独立波特率发生器
} 
/************************************************************
				   向串口uart1发送一个字符
*************************************************************/
void send_char_com(unsigned char ch)  
{
    SBUF=ch;
    while(TI==0);
    TI=0;
}
/************************************************************
	向串口uart1发送一个字符串，strlen为该字符串长度
*************************************************************/
void send_string_com(unsigned char *str)
{
    unsigned int k=0;
	
	do
    {
        send_char_com(*(str + k));
        k++;
    } while(k < strlen(str));
}



